app/Controllers/AdminController/BannerController.php

SELECT *
FROM `banner`
WHERE `banner`.`deleted_at` IS NULL
---
    public function index()
    {
        $bannerModel = new BannerModel();
        $prodData = $bannerModel->findAll();