app/Controllers/AdminController/ProductController.php

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
---
    public function index()
    {
        $productModel = new ProductModel();
        $prodData = $productModel->findAll();