app/Controllers/AdminController/TestimonialsController.php

    public function index()
    {
        $testModel = new TestimonialsModel();
        $prodData = $testModel->findAll();
---
SELECT *
FROM `testimonials`
WHERE `testimonials`.`deleted_at` IS NULL