app/Controllers/Home.php

    public function index(): string
    {
        $bannerModel = new BannerModel();
        $testimonialsModel = new TestimonialsModel();
        $prodModel = new ProductModel();
        $products_bestseller = $prodModel->select('p_id,p_image_1,p_image_2,p_name,p_rating,p_categories,old_price,new_price,p_tags,created_at')->where('p_tags', 'Bestseller')->findAll();
        $products_indemand = $prodModel->select('p_id,p_image_1,p_image_2,p_name,p_rating,p_categories,old_price,new_price,p_tags,created_at')->where('p_tags', 'Indemand')->findAll();
        $products_latest = $prodModel->select('p_id,p_image_1,p_image_2,p_name,p_rating,p_categories,old_price,new_price,p_tags,created_at')->where('p_tags', 'Latest')->findAll();
        $products = $prodModel->select('p_id,p_image_1,p_image_2,p_name,p_rating,p_categories,old_price,new_price,p_tags,created_at')->findAll();
        $banner = $bannerModel->select('banner_id,banner_image,banner_title,banner_order_by')->orderBy('banner_order_by')->findAll();
        $testimonials = $testimonialsModel->select('test_id,test_name,test_image,test_review,test_profession,test_order_by')->orderBy('test_order_by')->findAll();
---
SELECT `p_id`, `p_image_1`, `p_image_2`, `p_name`, `p_rating`, `p_categories`, `old_price`, `new_price`, `p_tags`, `created_at`
FROM `products`
WHERE `p_tags` = 'Bestseller'
AND `products`.`deleted_at` IS NULL
SELECT `p_id`, `p_image_1`, `p_image_2`, `p_name`, `p_rating`, `p_categories`, `old_price`, `new_price`, `p_tags`, `created_at`
FROM `products`
WHERE `p_tags` = 'Indemand'
AND `products`.`deleted_at` IS NULL
SELECT `p_id`, `p_image_1`, `p_image_2`, `p_name`, `p_rating`, `p_categories`, `old_price`, `new_price`, `p_tags`, `created_at`
FROM `products`
WHERE `p_tags` = 'Latest'
AND `products`.`deleted_at` IS NULL
SELECT `p_id`, `p_image_1`, `p_image_2`, `p_name`, `p_rating`, `p_categories`, `old_price`, `new_price`, `p_tags`, `created_at`
FROM `products`
WHERE `products`.`deleted_at` IS NULL
SELECT `banner_id`, `banner_image`, `banner_title`, `banner_order_by`
FROM `banner`
WHERE `banner`.`deleted_at` IS NULL
ORDER BY `banner_order_by`
SELECT `test_id`, `test_name`, `test_image`, `test_review`, `test_profession`, `test_order_by`
FROM `testimonials`
WHERE `testimonials`.`deleted_at` IS NULL
ORDER BY `test_order_by`