app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `email` = 'gamerdhriti19@gmail.com'
AND `password` = '827ccb0eea8a706c4c34a16891f84e7b'
 LIMIT 1
---
    public function checklogindata($email, $password)
    {



        $result = $this->where(['email' => $email, 'password' => $password])->first();